# config.py
# Данный файл является единой точкой хранения всех констант и настроек проекта.

# =============================================================================
# НАСТРОЙКИ ИМПОРТА ДАННЫХ
# =============================================================================

COLUMNS_CONFIG = {
    # 2. Колонки логов (меняются во времени)
    # Сюда пишем датчики и текущие положения клапанов
    "ts_cols": [
        "X1213_OPN - клапан порошка откр",
        "X1213_CLS - клапан порошка закр",
        "Curve_cycle_1",
        "Curve_cycle_2",
        "Curve_cycle_3",
        "Curve_cycle_4",
        "Curve_cycle_5",
        "Curve_cycle_6",
        "Curve_cycle_7",
        "Curve_cycle_8",
        "Curve_cycle_9",
        "LD31W.Spray.PT1014 - давление трубе",
        "LD31W.Vessel.PT1009 - давление баке",
        "DB_Internal\Cmd_PUY1019 - давление в спирали",
        "LD31W.VALVE 1007 - клапан бака, бар",
        "LD31W.VALVE 1008 - клапан трубы, бар",
        "LD31W.VALVE 1019 - клапан спирали, бар",
        "IBA_DB\PT1014 Актуальное давление в трубе (бар)",
        "IBA_DB\PT1009 Актуальное давление в баке P1 (бар)",
        "IBA_DB\PT1010 Актуальное давление в спирали (бар)",
        "LD31W.Weigh P1 - вес в баке",
    ],

    # 3. Колонки реестра (константы цикла)
    # Сюда пишем то, что берется один раз в момент открытия клапана
    "reg_cols": [
        "LD11C1\Process Data.BarDiameter (Диаметр заготовки)",
        "LD31W.Weigh P1 - вес в баке",
        # "LD31W.IMS_Diameter (Диаметр гильзы)",
        "CtpOut002_Shell_length (Длина гильзы)",
        "CtpOut056_Plug_bar_diameter (Диаметр оправки)",
        "63: Tube diameter at FQT outlet",
        "IBA_DB\PT1009 Актуальное давление в баке P1 (бар)",
        "IBA_DB\PT1014 Актуальное давление в трубе (бар)",
        "LD31W.VALVE 1007 - клапан бака, бар",
        "LD31W.VALVE 1008 - клапан трубы, бар",
    ]
}

    # 4. Колонки для осреднения циклов по сортаменту
DETAILED_COLS = [
        "IBA_DB\PT1014 Актуальное давление в трубе (бар)",
        "IBA_DB\PT1009 Актуальное давление в баке P1 (бар)",
        "IBA_DB\PT1010 Актуальное давление в спирали (бар)",
        "LD31W.Weigh P1 - вес в баке",  
        "LD31W.Vessel.PT1009 - давление баке",
        "LD31W.VALVE 1007 - клапан бака, бар",
        "LD31W.VALVE 1008 - клапан трубы, бар",
        "X1213_CLS - клапан порошка закр", 
    ]

    # 5. Параметры тригеров для модели прогнозирования
EXTRACTION_SETTINGS = {
    "trigger_open": "X1213_OPN - клапан порошка откр",                  # имя переменной открытия клапана
    "trigger_close": "X1213_CLS - клапан порошка закр",                 # имя переменной закрытия клапана
    "time_col": "Time_Stamp",                                           # 
    "t_before": 20.0,                                                   # отрезок времени до открытия
    "t_after": 20.0,                                                    # отрезок времени после открытия
    "MAX_ALLOWED_DURATION": 25.0,                                       # максимальное время после открытия для фильтрации плохих случаев
    "actual_p_col": "IBA_DB\PT1009 Актуальное давление в баке P1 (бар)" # актуальное давление в баке для вычисления ошибки   
}

# =============================================================================
# НАСТРОЙКИ ОБРАБОТКИ И ВЫВОДА ДАННЫХ
# =======================================================================

# Универсальная конфигурация классификации
CLASSIFICATION_TASKS = [
    {
        "source_col": "LD11C1\Process Data.BarDiameter (Диаметр заготовки)",
        "target_col": "Dia_Shell",
        "bins": [182, 273, 334],
        "prefix": "D_" # Можно добавить для красоты (напр. "D")
    },
    {
        "source_col": "CtpOut002_Shell_length (Длина гильзы)",
        "target_col": "L_Shell",
        "bins": [5000, 6000, 7000, 8000, 9000, 10000, 11300],
        "prefix": "L_"
    },
    # {
    #     "source_col": "LD31W.Weigh P1 - вес в баке",
    #     "target_col": "Weight_Group",
    #     "bins": [1100],  # Если одно значение -> будет <150 и >150
    #     "prefix": "W_"
    # }
]

# Параметры генерации заданного сигнала в баке на основе настроек
CONFIG_GENERATE_TARGET_TANK = {
    'phases': {
        't_pre_charge': -15.0,  # Начало предварительной надувки
        't_dip_start': 0,    # Начало короткого провала перед впрыском
        't_start': 0.0,         # Точка физического старта цикла
    },

    'columns': {
        'col_cycle': 'cycle_id',
        'col_time': 't_relative',
        'prefix_col': '_tank',  
        'col_target': 'p_tank_target',
        'col_target_rounded': 'p_tank_target_rounded',   
    }
}

# Параметры генерации заданного сигнала в трубе на основе настроек
CONFIG_GENERATE_TARGET_PIPE = {
    'phases': {
        't_pre_charge': 0.0,  # Начало предварительной надувки
        't_dip_start': 0.0,    # Начало короткого провала перед впрыском
        't_start': 0.0,         # Точка физического старта цикла
    },

    'columns': {
        'col_cycle': 'cycle_id',
        'col_time': 't_relative',
        'prefix_col': '_pipe',  
        'col_target': 'p_pipe_target',
        'col_target_rounded': 'p_pipe_target_rounded',   
    }
}

# =============================================================================
# НАСТРОЙКИ МОДЕЛИ ПРОГНОЗА И ОПТИМИЩАЦИИ
# =======================================================================

DEFAULT_DT: float = 0.2

# Параметры модели прогнозирования давления в баке
CONFIG_PREDICTOR_TANK = {
    'col_time': 't_relative',
    'col_cycle': 'cycle_id',

    'col_target': 'p_tank_target_rounded',          # Прогноз по округленному значению
    # 'col_target_tank': 'p_tank_target',           # Прогноз по значению с пульта
    'col_result': 'p_tank_theory',
    'col_MAE': 'MAE_tank',
    'col_actual': 'IBA_DB\PT1009 Актуальное давление в баке P1 (бар)_median'
}

# Параметры модели прогнозирования давления в трубе
CONFIG_PREDICTOR_PIPE = {
    'col_time': 't_relative',
    'col_cycle': 'cycle_id',

    'col_target': 'p_pipe_target_rounded',          # Прогноз по округленному значению
    # 'col_target_pipe': 'p_pipe_target',           # Прогноз по значению с пульта
    'col_result': 'p_pipe_theory',
    'col_MAE': 'MAE_pipe',
    'col_actual': 'IBA_DB\PT1014 Актуальное давление в трубе (бар)_median'
}

# =============================================================================
# НАСТРОЙКИ ИИНТЕРФЕЙСА И ВИЗУАЛИЗАЦИИ
# =======================================================================

# графики которые выводятся в интерфейсе
SENSORS_LIST = [
    "LD31W.Weigh P1 - вес в баке_median",
    "IBA_DB\PT1009 Актуальное давление в баке P1 (бар)_median",
    "LD31W.VALVE 1007 - клапан бака, бар_median",
    "p_tank_target",
    "p_tank_theory",
    "p_tank_target_rounded",

    "IBA_DB\PT1014 Актуальное давление в трубе (бар)_median",
    "LD31W.VALVE 1008 - клапан трубы, бар_median",
    "p_pipe_target",
    "p_pipe_theory",
    "p_pipe_target_rounded",
]